{
    "versions": [
        {
            "package_version": "1.2.2",
            "download_url": "https://github.com/Mysteryem/Psychonauts_AP_PopTracker/archive/refs/tags/v1.2.2.zip",
            "sha256": "0c3d0a8322195b9d8ef29f8acefd12f689c242c952b36917735e73a4c25548be",
            "changelog": [
                "The Dowsing Rod and Super Palm Bomb images were missing and have now been added."
            ]
        },
        {
            "package_version": "1.2.1",
            "download_url": "https://github.com/Mysteryem/Psychonauts_AP_PopTracker/archive/refs/tags/v1.2.1.zip",
            "sha256": "43b24efa49df9768e0cc02a26b7157a6fb7c97902c63401cd8cd971f31676469",
            "changelog": [
                "Added a temporary tracker variant to support the Item IDs of the v0.5.0 AP World.",
                "Use this if you are connecting to a slot generated with an AP world version older than v0.6.0."
            ]
        },
        {
            "package_version": "1.2.0",
            "download_url": "https://github.com/Mysteryem/Psychonauts_AP_PopTracker/archive/refs/tags/v1.2.0.zip",
            "sha256": "77f3786d4a693f6f80e91d55e67fecb37cf13cb285ce0d87742c9f641ee5d38d",
            "changelog": [
                "Supports Psychonauts AP World v0.6.0.",
                "Updated the item IDs to match the AP World.",
                "Added the new Dowsing Rod and Super Palm Bomb items to the tracker.",
                "Added the (CA Lake) Lungfish Boss Complete location.",
                "Deep Arrowhead and Mental Cobweb locations are not implemented yet.",
                "",
                "General Changes",
                "- Because the maximum quantity of certain items can now vary, the maximum quantity has been removed from most 'consumable' type items",
                "",
                "Out-of-logic Changes",
                "- Added Gloria's Theater Storage Room access without Invisibility, using a Candle and Pyrokinesis"
            ]
        },
        {
            "package_version": "1.1.1",
            "download_url": "https://github.com/Mysteryem/Psychonauts_AP_PopTracker/archive/refs/tags/v1.1.1.zip",
            "sha256": "60fe7584bf54b77643b3b29ed0d306fe063975819d32e225cffef08b4006fa34",
            "changelog": [
                "Supports Psychonauts AP World v0.5.0.",
                "",
                "General Changes",
                "- The Asylum, Gloria's Theater and Meat Circus maps have been made brighter",
                "- Sped up connecting to an in-progress AP slot by briefly disabling tracker updates while all the items from AP are received",
                "- The default Chest icons on locations have been replaced with Memory Vault icons",
                "- The Goal locations' Chest icons have been replaced with the icon for that Goal",
                "",
                "Logic Changes",
                "- Updated `(AS Courtyard) Crow's Basket` for the new Invisibility requirement",
                "",
                "Out-of-logic Changes",
                "- Added missing Main Lodge access to reach Book Depository without Shield (to be able to buy Dream Fluffs)",
                "- Added `(CA Main) Parking Lot History Board` without Levitation",
                "- Added `(MM Neighborhood) Inside Webbed Garage` without Cobweb Duster, using Marksmanship",
                "- Added Book Depository access without Flowers or Pyrokinesis, using Marksmanship",
                "- Added `(BV Streets) Club Street Metal Balcony` without Levitation",
                "- Added `(AS Upper) Room Opposite Chair Door` without Telekinesis, using Marksmanship",
                "- Added `(BB Area 2) Trapeze Cobweb` without Cobweb Duster, using Marksmanship",
                "- Added `(TH Stage) In the Audience` without Levitation"
            ]
        },
        {
            "package_version": "1.1.0",
            "download_url": "https://github.com/Mysteryem/Psychonauts_AP_PopTracker/archive/refs/tags/v1.1.0.zip",
            "sha256": "47f968254a942e796ed61c2a2d5827e411fee1a6c08381e6cfa150361c0c7c1e",
            "changelog": [
                "Supports Psychonauts AP World v0.4.0.",
                "Logic has been updated to match the new AP World version.",
                "",
                "The pack now checks for new versions being available.",
                "",
                "Added a Settings tab for AP yaml settings.",
                " - Settings will automatically read their values from Slot Data when connecting to AP.",
                " - Goal locations are added to the tracker when the relevant goals are enabled in the Settings tab.",
                " - The goal settings are split into separate toggles for the Brain Tank goal and RequireMeatCircus.",
                " - The Brain Hunt goal is enabled whenever the BrainsRequired is above zero.",
                " - The number of BrainsRequired is automatically set to zero when the brain hunt goal is not enabled.",
                " - One level of Levitation is automatically added/removed when the StartingLevitation setting is toggled.",
                " - InstantDeathMode and EnemyDamageMultiplier are combined into one setting with the damage multiplier displaying as infinite when InstantDeathMode is enabled.",
                "",
                "Added out-of-logic access to (AS Upper) Sink Platform Left/Right without Levitation."
            ]
        },
        {
            "package_version": "1.0.0",
            "download_url": "https://github.com/Mysteryem/Psychonauts_AP_PopTracker/archive/refs/tags/v1.0.0.zip",
            "sha256": "afab90756bb261ad70d568700f2a407b0dfe19eda3816999cb811adbcd9a27e7",
            "changelog": [
                "First release with all maps, items and locations present with AP autotracking.",
                "Supports Psychonauts AP World v0.3.3.",
                "Special AP autotracking features:",
                " - Collecting Baggage reduces the count of the corresponding Baggage Tag when collected so that the Tag count matches the number of tags of that type in Raz's inventory.",
                " - The total count of Camper Brains is automatically increased when a Brain is collected. The specific found/missing Brains can be seen in the Brains tab.",
                "Adds accessible, but out-of-logic access (yellow locations)",
                "Out-of-logic access can be turned off in the Pack Settings (between Broadcast View and AP autotracking toggle), turning all yellow locations red instead."
            ]
        }
    ]
}